<template>
  <div>
    <div class="container">
      <div class='inner'>
        <div>
          <p>
2、 希望源于失望，奋起始于忧患，正如一位诗人所说：有饥饿感受的人一定消化好，有紧迫感受的人一定效率高，有危机感受的人一定进步快。
3、 别在树下徘徊，别在雨中沉思，别在黑暗中落泪。向前看，不要回头，只要你勇于面对抬起头来，就会发现，分数的阴霾不过是短暂的雨季。向前看，还有一片明亮的天，不会使人感到彷徨。
4、 柔和的阳光斜挂在苍松翠柏不凋的枝叶上，显得那么安静肃穆，绿色的草坪和白色的水泥道貌岸然上，脚步是那么轻起轻落，大家的心中却是那么的激动与思绪波涌。
5、 生活的海洋并不像碧波涟漪的西子湖，随着时间的流动，它时而平静如镜，时而浪花飞溅，时而巨浪冲天……人们在经受大风大浪的考验之后，往往会变得更加坚强。
6、 当你身临暖风拂面，鸟语花香，青山绿水，良田万顷的春景时，一定会陶醉其中；当你面对如金似银，硕果累累的金秋季节时，一定会欣喜不已。你可曾想过，那盎然的春色却是历经严寒洗礼后的英姿，那金秋的美景却是接受酷暑熔炼后的结晶。
7、 倘若希望在金色的秋天收获果实，那么在寒意侵人的早春，就该卷起裤腿，去不懈地拓荒、播种、耕耘，直到收获的那一天。
8、 生活是蜿蜒在山中的小径，坎坷不平，沟崖在侧。摔倒了，要哭就哭吧，怕什么，不心装模作样！这是直率，不是软弱，因为哭一场并不影响赶路，反而能增添一份小心。山花烂漫，景色宜人，如果陶醉了，想笑就笑吧，不心故作矜持！这是直率，不是骄傲，因为笑一次并不影响赶路，反而能增添一份信心</p>
          <p v-for='(x, index) in dataArr' :key="index">{{x}}</p>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data () {
    return {
      dataArr: []
    }
  },
  created () {
    this.getData()
  },
  methods: {
    getData () {
      for (let i = 0; i < 100; i++) {
        this.dataArr.push(i)
      }
    }
  }
}
</script>
<style scoped>
 li {
   height: 100px;
 }
</style>
